In [3]:
import pandas as pd

In [4]:
# INICIANDO COM DATAFRAME
pd.DataFrame({'Yes': [50, 105], 'No': [500, 300]})

   Yes   No
0   50  500
1  105  300

In [5]:
# NO INDEX É CRIADO AUTOMATICAMENTE
pd.DataFrame({'Name': ['Wes McKinney', 'Guido Van Rossum'], 'Number': [500, 120]})

               Name  Number
0      Wes McKinney     500
1  Guido Van Rossum     120

In [6]:
# Alterando os valores padrão dos index da linha
pd.DataFrame({
    'Column 1': [20, 50, 60],
    'Column 2': [25, 60, 20],
    'Column 3': ['hello', 'how are you', 'bye']
}, index=['Linha 1', 'Linha 2', 'Linha 3'])

         Column 1  Column 2     Column 3
Linha 1        20        25        hello
Linha 2        50        60  how are you
Linha 3        60        20          bye

In [7]:
# INICIANDO SERIES
pd.Series([1, 2, 4, 6, 8, 10])

0     1
1     2
2     4
3     6
4     8
5    10
dtype: int64

In [8]:
pd.Series([1, 2, 3], index=['Valor 1', 'Valor 2', 'Valor 3'], name='NOME DA LISTA')

Valor 1    1
Valor 2    2
Valor 3    3
Name: NOME DA LISTA, dtype: int64

In [9]:
# INICIANDO ARQUIVO CSV
csv_titanic = pd.read_csv('titanic.csv')

In [10]:
# TAMANHO DO DATAFRAME --> out (linha, coluna)
csv_titanic.shape

(418, 11)

In [11]:
# MOSTRA O CABEÇALHO E ALGUNS DADOS
csv_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [12]:
# ESCOLHENDO QUAL COLUNA MOSTRAR PRIMEIRO. COM ISSO NÃO CRIA UMA COLUNA CONTABILIZADA
csv_titanic_index = pd.read_csv('titanic.csv', index_col=2) # utiliza a coluna 2 como dominante
csv_titanic_index.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,male,34.5,0,0,330911,7.8292,NaN,Q
"Wilkes, Mrs. James (Ellen Needs)",893,3,female,47.0,1,0,363272,7.0000,NaN,S
"Myles, Mr. Thomas Francis",894,2,male,62.0,0,0,240276,9.6875,NaN,Q
"Wirz, Mr. Albert",895,3,male,27.0,0,0,315154,8.6625,NaN,S
"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
csv_titanic.Name

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [14]:
csv_titanic['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [15]:
# UTILIZANDO PYTHON PARA CAPTURAR UM INDEX ESPECÍFICO
csv_titanic['Name'][417]

'Peter, Master. Michael J'

In [16]:
# UTILIZANDO OPERADORES DO PANDAS loc e iloc para operações mais avançadas
# ILOC é utilizada em seleção baseada em índice
csv_titanic.iloc[417]

PassengerId                        1309
Pclass                                3
Name           Peter, Master. Michael J
Sex                                male
Age                                 NaN
SibSp                                 1
Parch                                 1
Ticket                             2668
Fare                            22.3583
Cabin                               NaN
Embarked                              C
Name: 417, dtype: object

In [17]:
csv_titanic.iloc[417]

PassengerId                        1309
Pclass                                3
Name           Peter, Master. Michael J
Sex                                male
Age                                 NaN
SibSp                                 1
Parch                                 1
Ticket                             2668
Fare                            22.3583
Cabin                               NaN
Embarked                              C
Name: 417, dtype: object

In [18]:
csv_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [19]:
csv_titanic.iloc[:2, 2:5] # (LINHA, COLUNA)

                               Name     Sex   Age
0                  Kelly, Mr. James    male  34.5
1  Wilkes, Mrs. James (Ellen Needs)  female  47.0

In [39]:
csv_titanic.iloc[-5:] # BUSCA O FINAL DO DATAFRAME

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [18]:
# LOC é utilizada em seleção baseada em valor do índice
csv_titanic.loc[417, ['Name', 'Sex']] # no index 417 eu quero o valor de nome e sexo

Name    Peter, Master. Michael J
Sex                         male
Name: 417, dtype: object

In [19]:
# CONFIGURANDO O ÍNDICE DOMINANTE DO DATAFRAME
csv_titanic.set_index('Name')

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,male,34.5,0,0,330911,7.8292,NaN,Q
"Wilkes, Mrs. James (Ellen Needs)",893,3,female,47.0,1,0,363272,7.0000,NaN,S
"Myles, Mr. Thomas Francis",894,2,male,62.0,0,0,240276,9.6875,NaN,Q
"Wirz, Mr. Albert",895,3,male,27.0,0,0,315154,8.6625,NaN,S
"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
"Spector, Mr. Woolf",1305,3,male,NaN,0,0,A.5. 3236,8.0500,NaN,S
"Oliva y Ocana, Dona. Fermina",1306,1,female,39.0,0,0,PC 17758,108.9000,C105,C
"Saether, Mr. Simon Sivertsen",1307,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
"Ware, Mr. Frederick",1308,3,male,NaN,0,0,359309,8.0500,NaN,S
"Peter, Master. Michael J",1309,3,male,NaN,1,1,2668,22.3583,NaN,C

In [43]:
csv_titanic['Sex'][417] == 'male'

True

In [48]:
csv_titanic.Sex
csv_titanic['Sex'] # o mesmo que o de cima

0        male
1      female
2        male
3        male
4      female
        ...
413      male
414    female
415      male
416      male
417      male
Name: Sex, Length: 418, dtype: object

In [50]:
csv_titanic.iloc[0]

PassengerId                 892
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [51]:
indexs = [1, 2, 4, 200, 417]
csv_titanic.loc[indexs]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
200,1092,3,"Murphy, Miss. Nora",female,NaN,0,0,36568,15.5000,NaN,Q
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [52]:
indexs = [1, 2, 4, 200, 417]
columns = ['Name', 'Sex', 'Ticket']

csv_titanic.loc[indexs, columns]

                                             Name     Sex   Ticket
1                Wilkes, Mrs. James (Ellen Needs)  female   363272
2                       Myles, Mr. Thomas Francis    male   240276
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  3101298
200                            Murphy, Miss. Nora  female    36568
417                      Peter, Master. Michael J    male     2668

In [22]:
csv_titanic[csv_titanic.Name == 'Myles, Mr. Thomas Francis']

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q